app/controllers/searches_controller.rb

  def index
    @searches = Search.all
    @search_str = ["abcd"]

    if current_user
      @searches.each do |search|
        if search.user_id === current_user.id
          @search_str.replace([search.name])
        else
          @search_str.replace([search.name])
        end
      end
      else
        @searches.each do |search|
            @search_str.replace([search.name])
        end
      end

      if current_user
        @user_searches = current_user.searches
    end

    @words = Word.all
---
SELECT "searches".* FROM "searches"
SELECT "words".* FROM "words"

  def create
    @search = Search.new(search_params)
    @search.user = current_user
    if @search.save
---
INSERT INTO "searches" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "abc"], ["user_id", 1], ["created_at", "2019-03-11 12:24:20.429475"], ["updated_at", "2019-03-11 12:24:20.429475"]]

  def edit
    @search = Search.find(params[:id])
    @user = User.find(@search.user_id)
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]