app/controllers/words_controller.rb

SELECT  "words".* FROM "words" ORDER BY "words"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "words".* FROM "words"
---
  def index

      @words = Word.all
      @noun = "noun"
      @verb = "verb"
      @article = "article"

      @noun_arr = []
      @verb_arr = []
      @article_arr = []
      @input = "abcd"
      @input_array = @input.chars
      @output = []
      num_arr = 0

       @words.each do |word|